#author:yang
#--------------------------------算术运算符-----------------------
#1.+
#-
# *
# /
# //(整除)
# %(取余)
# **(幂)
a = 10
b = 3
c =a % b
print(c)
print(a**2)

#------------------------------------比较运算符------------------
#1.==:比较左右两边的值是否相等
#2.!=:比较左右两边的值是否不想等
#3.>:比较左边的值是否大于右边的值
#4.<:比较左边的值是否大于右边的值
#5.>=:比较左边的值是否大于等于右边的值
#6.<=:比较左边的值是否小于等于右边的值

#----------------------------赋值运算符----------------
#1,= 简单的赋值运算 a= b + c 等效于将b+c的值附加给a
#2.+=加法赋值运算符   a+=b  等效于a=a+b
#3.-=减法赋值运算符    a-=b  等效于a=a-b
#4.*=乘法赋值运算符    a*=b  等效于a=a*b
#5./=除法赋值运算符    a/=b  等效于a=a/b
#6.%=取余赋值运算符    a%=b  等效于a=a%b
#7.**=幂赋值运算符    a**=b  等效于a=a**b
#8.//=整除赋值运算符    a//=b  等效于a=a//b

#---------------------------逻辑运算符------------------
#and--与   a and b:条件a和条件b同时成立的时候,结果是True.如果a和b其中任何一个不满足,则结果为False
#or--或    a or b:条件a和条件b任何一个条件满足,结果是True,如果条件a和b都不满足,结果为False
#not--非  not a :条件a结果为True,则结果为False,如果a条件不满足,则结果为True

#-----------------成员运算符------------------
#1.in      a in b:判断a是否在b中,如果a在b中则返回True,如果不在,则返回False
#2.not in      a not in b:判断a是否在b中,如果不在则返回True,如果在则返回False

#-------------------------------身份运算符-----------------------
#1.is a is b:判断a对象和b对象是否为同一个对象,如果是则返回True,如果不是则返回False
#2.is not a is not b:判断a对象和b对象是否不是同一个对象,如果不是同一个则返回True,如果是同一个对象则返回False

