"""
座右铭:路漫漫其修远兮,吾将上下而求索
@project:正课第二周
@author:Mr.Yang
@file:面向过程和面向对象.PY
@ide:PyCharm
@time:2018-07-30 09:31:44
"""
#面向过程”(Procedure Oriented)是一种以过程为中心的编程思想。“面向过程”也可称之为“面向记录”编程思想，他们不支持丰富的“面向对象”特性（比如继承、多态），并且它们不允许混合持久化状态和域逻辑。就是分析出解决问题所需要的步骤，然后用函数把这些步骤一步一步实现，使用的时候一个一个依次调用就可以了。

#面向对象是指一种程序设计范型，同时也是一种程序开发的方法。对象指的是类的集合。它将对象作为程序的基本单元，将程序和数据封装其中，以提高软件的重用性、灵活性和扩展性。

#解决菜鸟买手机的例子:
#第一种方式:
#第一步:查找资料.比对几款手机的配置和价格,来最终绝对买哪一款
#第二步:根据自己的小金库还有自己对手机的需求,决定买个IphoneX
#第三步:拿着钱去实体店手机,业务员听说要买iPhone X,给你推荐了另一款手机iPhoneXX,他一忽悠.说iponexx比iponex跟便宜,配置跟高,于是一想,反正都是iphone,最终买了iponexx
#第四步:砍价,最终8000块钱买了个iPhonexx
#第五步:结账付款,拿到手机
#第六步:回到家,欣喜万分拆开手机,最终发现是山寨版

#第二种方式:
#找一个懂手机的专业人士,让他给你买,

#买手机的第一种方式,强调的是过程,步骤每一步都需要自己亲自实现,这种思路叫做面向过程,
#买手机的第二种方式,强调是专业人士这个对象,使用专业人士买手机,菜鸟不需要亲自一步一步的去实现买手机的过程,所有的难题交给专业人士来解决,这种问题的思路叫做面向对象.


#面向对象的思维解决问题的重点:
#1.当遇到一个需求的时候,不用自己一步一步的去实现
#2.找一个专业的人士来实现买手机的这个过程

#面向对象,基于面向过程.

#面试题可能会问到的概念:
#面向对象(00)
#面向对象编程(00P)
#面向对象分析(00A)
#面向对象的设计(00D)



