"""
座右铭:路漫漫其修远兮,吾将上下而求索
@project:正课第三周
@author:Mr.Yang
@file:URL.PY
@ide:PyCharm
@time:2018-08-06 09:02:56
"""
#1.什么是URL?
#统一资源占位符,也就是我们常说的网址,是对可以从互联网上得到资源的位置和访问的一种简介的表示,是互联网上标准的资源的地址.
#1.URl的组成部分:
#协议:(或者叫做服务方式http/https)
#存有资源的主机的IP地址(有时候也包括端口号)
#主机资源的具体地址,如目录或者文件名等

#URL的完整格式:
#1.协议(http/https/ftp.)
#2.服务器的IP地址或者域名.
#端口号(80,8080等等)
#访问资源的路径
#参数,发送给http服务器的数据

#端口:一台服务器IP地址的主机可以提供很多种服务,如web服务,ftp服务,smtp服务,
# 那么主机是怎么区别这些服务的呢?为了区别这些服务,于是便通过ip地址,端口号来区别不同的服务

#端口号(常识,必须会):
#HTTP的端口号:80
#HTTPS的端口号:443
#邮箱的端口号:25
#数据库的端口号:3306
#微信的端口号: 80

